KarlK90/qmk_firmware/platforms/chibios/vendors/RP/RP2350/_pin_defs.h
// Copyright 2024 Stefan Kerkmann
// SPDX-License-Identifier: GPL-2.0-or-later

#pragma once

/* RP2350 GPIO Numbering */
#define GP0 0U
#define GP1 1U
#define GP2 2U
#define GP3 3U
#define GP4 4U
#define GP5 5U
#define GP6 6U
#define GP7 7U
#define GP8 8U
#define GP9 9U
#define GP10 10U
#define GP11 11U
#define GP12 12U
#define GP13 13U
#define GP14 14U
#define GP15 15U
#define GP16 16U
#define GP17 17U
#define GP18 18U
#define GP19 19U
#define GP20 20U
#define GP21 21U
#define GP22 22U
#define GP23 23U
#define GP24 24U
#define GP25 25U
#define GP26 26U
#define GP27 27U
#define GP28 28U
#define GP29 29U
#define GP30 30U
#define GP31 31U
#define GP32 32U
#define GP33 33U
#define GP34 34U
#define GP35 35U
#define GP36 36U
#define GP37 37U
#define GP38 38U
#define GP39 39U
#define GP40 40U
#define GP41 41U
#define GP42 42U
#define GP43 43U
#define GP44 44U
#define GP45 45U
#define GP46 46U
#define GP47 47U
